In [ ]:
# Import dependencies.
from sqlite3 import connect
import pandas as pd

In [ ]:
# Connect or create a database and get cursor.
conn = connect('./data/analysis.db')
cursor = conn.cursor()

In [ ]:
# Create teachers table.
query = """
CREATE TABLE teachers (
    id INTEGER PRIMARY KEY,
    first_name TEXT,
    last_name TEXT,
    school TEXT,
    hire_date TEXT,
    salary REAL
);
"""

cursor.execute(query)

In [ ]:
# Insert data into teachers table.
query = """
INSERT INTO teachers (first_name, last_name, school, hire_date, salary) VALUES ('Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),
       ('Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
       ('Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),
       ('Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),
       ('Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),
       ('Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500);
"""

cursor.execute(query)

In [ ]:
# Quickly look at the table.
df = pd.read_sql_query('SELECT * FROM teachers', conn)
df

In [ ]:
# Query a subset of columns.
df = pd.read_sql_query('SELECT last_name, first_name, salary FROM teachers;', conn)
df

In [ ]:
# Sort using ORDER BY.
df = pd.read_sql_query('SELECT last_name, first_name, salary FROM teachers ORDER BY salary DESC;', conn)
df

In [ ]:
# Sort by more than one column.
df = pd.read_sql_query('SELECT last_name, school, hire_date FROM teachers ORDER BY school ASC, hire_date DESC;', conn)
df

In [ ]:
# Eliminate duplicates with DISTINCT.
df = pd.read_sql_query('SELECT DISTINCT school FROM teachers;', conn)
df

In [ ]:
# Use DISTINCT with more than one column.
df = pd.read_sql_query('SELECT DISTINCT school, salary FROM teachers;', conn)
df

In [ ]:
# Filter rows with WHERE.
df = pd.read_sql_query('SELECT last_name, school, hire_date FROM teachers WHERE school = "Myers Middle School"', conn)
df

In [ ]:
# LIKE with WHERE example.
df = pd.read_sql_query('SELECT first_name FROM teachers WHERE first_name LIKE "sam%"', conn)
df

On SQLite the ILIKE operator does not exist.

In [ ]:
# Combine operators with AND.
df = pd.read_sql_query('SELECT * FROM teachers WHERE school = "Myers Middle School" AND salary < 40000;', conn)
df

In [ ]:
# Combine operators with OR.
df = pd.read_sql_query('SELECT * FROM teachers WHERE last_name = "Cole" OR last_name = "Bush"', conn)
df

In [ ]:
# It's better to follow the next convention when writing queries.
df = pd.read_sql_query('SELECT * FROM teachers WHERE school LIKE "%Roos%" ORDER BY hire_date DESC;', conn)
df

In [ ]:
# Clean up teachers table.
query = """
DROP TABLE teachers;
"""

cursor.execute(query)

In [ ]:
# Close connection.
conn.close()